{
    "Astilbe": "Astilbe is a delicate and elegant plant with feathery, plume-like flowers that come in shades of pink, white, and red.\nPerfect for shady gardens, it thrives in moist soil and adds a touch of grace to any landscape.\nIts flowers also attract beneficial insects, making it a valuable addition to eco-friendly gardens.\n",
    "Bellflower": "The Bellflower, known for its charming bell-shaped blooms in blue, purple, or white, is a delightful addition to any garden.\nIt attracts pollinators like bees and butterflies, enhancing the natural beauty around it.\nBellflowers also symbolize gratitude and everlasting love, making them popular in floral arrangements.\n",
    "Black-Eyed Susan": "Black-Eyed Susans are iconic wildflowers with bright yellow petals and dark centers.\nSymbolizing encouragement and strength, they brighten up fields, gardens, and floral arrangements alike.\nThese hardy flowers are also drought-tolerant, thriving in various environments with minimal care.\n",
    "Calendula": "Calendula, or pot marigold, is cherished for its vibrant orange or yellow flowers and medicinal properties.\nIts edible petals make it a versatile plant for gardens and kitchens.\nCalendula has been used historically to treat skin conditions and promote healing.\n",
    "California Poppy": "The California Poppy, with its radiant orange petals, is a symbol of the Golden State.\nThriving in dry, sunny areas, it brings a splash of color to wild landscapes.\nThis poppy is also known for its calming properties and use in herbal remedies.\n",
    "Carnation": "Carnations are timeless flowers celebrated for their ruffled petals and rich history.\nAvailable in a rainbow of colors, each shade carries its own unique meaning and charm.\nThey are long-lasting in bouquets, making them a favorite choice for special occasions.\n",
    "Common Daisy": "The Common Daisy is a symbol of innocence and cheerfulness, with its white petals and sunny yellow center.\nIts simplicity makes it a favorite in gardens and meadows.\nDaisies are also known for their resilience, often thriving in unexpected places.\n",
    "Coreopsis": "Coreopsis, often called 'tickseed,' is a low-maintenance flower that blooms in cheerful yellows and pinks.\nIts drought tolerance makes it ideal for sunny, dry gardens.\nThis flower is also known to attract birds, adding life and movement to outdoor spaces.\n",
    "Dandelion": "Often underestimated as a weed, the Dandelion is a versatile plant with edible leaves and medicinal roots.\nIts iconic seed heads are a favorite for making wishes.\nDandelions also support pollinators, providing nectar for bees early in the season.\n",
    "Iris": "The Iris, named after the Greek goddess of rainbows, dazzles with its vibrant and intricate blooms.\nThis perennial flower adds elegance and color to any garden.\nIrises have been associated with royalty and wisdom, often appearing in heraldry and art.\n",
    "Rose": "Roses are the ultimate symbol of love and beauty, with countless varieties in every color imaginable.\nTheir timeless appeal has made them cherished for centuries.\nRoses are also known for their fragrance, with some varieties prized for their unique and intoxicating scents.\n",
    "Sunflower": "Sunflowers, with their towering stems and golden faces, are nature's symbol of positivity.\nKnown for following the sun, they bring joy to fields and gardens alike.\nSunflowers are also cultivated for their nutritious seeds and oil, making them both beautiful and practical.\n",
    "Tulip": "Tulips, with their elegant and colorful blooms, are a hallmark of spring.\nOnce the center of a financial frenzy in the 17th century, they remain beloved worldwide.\nTulips are also easy to grow and adapt well to gardens and containers alike.\n",
    "Water Lily": "Water Lilies are enchanting aquatic flowers that float gracefully on still waters.\nTheir serene beauty symbolizes purity and tranquility in many cultures.\nThese flowers also provide shade and protection for aquatic life, contributing to balanced ecosystems.\n"
  }
  